In [1]:
import pandas as pd

C:\Users\Pepo\AppData\Local\Temp\ipykernel_14108\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Pandas arrays

In [9]:
# string array

intArray = pd.array([1, 2, 3, 4])

print(type(intArray))

intArray

<class 'pandas.core.arrays.integer.IntegerArray'>

<IntegerArray>
[1, 2, 3, 4]
Length: 4, dtype: Int64

In [10]:
strArray = pd.array(["1", "2", "3", "4"])

print(type(strArray))

strArray

<class 'pandas.core.arrays.string_.StringArray'>

<StringArray>
['1', '2', '3', '4']
Length: 4, dtype: string

In [12]:
mixedArray = pd.array([1, 2, "a", "b"])

print(type(mixedArray))

mixedArray

<class 'pandas.core.arrays.numpy_.NumpyExtensionArray'>

<NumpyExtensionArray>
['1', '2', 'a', 'b']
Length: 4, dtype: str352

In [14]:
# specify datatype, as best practice

# dtype=object -> keep as they are
# mixedArray = pd.array([1, 2, "a", "b"], dtype=object)

mixedArray = pd.array([1, 2, "a", "b"], dtype=str)

print(type(mixedArray))

mixedArray

<class 'pandas.core.arrays.numpy_.NumpyExtensionArray'>

<NumpyExtensionArray>
['1', '2', 'a', 'b']
Length: 4, dtype: str32

# Pandas timestamp

In [18]:
ts1 = pd.Timestamp("2024-01-31")

ts1

Timestamp('2024-01-31 00:00:00')

In [19]:
ts2 = pd.Timestamp("2024-01-31 16:00:00")

ts2

Timestamp('2024-01-31 16:00:00')

In [20]:
ts3 = pd.Timestamp(year=2024, month=1, day=31, hour=16)

ts3

Timestamp('2024-01-31 16:00:00')

In [22]:
# Attributes
print(ts1.year)
print(ts1.month)
print(ts1.day)
print(ts1.day_of_week)
print(ts1.day_of_year)
print(ts1.days_in_month)
print(ts1.is_month_end)

2024
1
31
2
31
31
True

In [24]:
# conversion method
ts1_str = ts1.strftime("%Y-%m-%d %H-%M-%S")

ts1_str

'2024-01-31 00-00-00'

In [26]:
# replace method
ts1 = ts1.replace(year=2023)

ts1

Timestamp('2023-01-31 00:00:00')

In [36]:
# timezone conversion

# ts1.tz_convert(tz="Azia/Tokyo")

ts2_w_tz = pd.Timestamp("2024-01-31 14:30:00", tz="UTC")
print(f"{ts2_w_tz!r}")

ts2_w_tz = ts2_w_tz.tz_convert(tz="Asia/Tokyo")
print(f"{ts2_w_tz!r}")

ts2_w_tz = ts2_w_tz.normalize()
print(f"{ts2_w_tz!r}")

Timestamp('2024-01-31 14:30:00+0000', tz='UTC')
Timestamp('2024-01-31 23:30:00+0900', tz='Asia/Tokyo')
Timestamp('2024-01-31 00:00:00+0900', tz='Asia/Tokyo')

In [39]:
print(ts1)
print(ts2_w_tz)

ts1 > ts2_w_tz

2023-01-31 00:00:00
2024-01-31 00:00:00+09:00

TypeError: Cannot compare tz-naive and tz-aware timestamps

# Time delta

In [41]:
td1 = pd.Timedelta(value=5, unit="D")

td1

Timedelta('5 days 00:00:00')

In [42]:
td1 = pd.Timedelta(days=5)

td1

Timedelta('5 days 00:00:00')

In [43]:
td1 = pd.Timedelta(52400, unit="s")

td1

Timedelta('0 days 14:33:20')

In [44]:
td1 = pd.Timedelta("12:34:56")

td1

Timedelta('0 days 12:34:56')

In [47]:
print(td1.components)
print(td1.components.days)
print(td1.components.hours)
print(td1.components.seconds)

Components(days=0, hours=12, minutes=34, seconds=56, milliseconds=0, microseconds=0, nanoseconds=0)
0
12
56

In [49]:
td1.total_seconds()

45296.0

In [50]:
td1 = pd.Timedelta("12:34:56")
td2 = pd.Timedelta(52400, unit="s")

print(td1 > td2)
print(td1 + td2)

False
1 days 03:08:16

# Interval

In [53]:
iv = pd.Interval(left=0, right=10)

iv

Interval(0, 10, closed='right')

In [55]:
print(5 in iv)
print(11 in iv)
print(2.5 in iv)
print(0 in iv)
print(10 in iv)
print(iv.left)
print(iv.right)
print(iv.length)

True
False
True
False
True
0
10
10

In [56]:
shifted_iv = iv + 5

shifted_iv

Interval(5, 15, closed='right')

In [57]:
extended_iv = iv * 10

extended_iv

Interval(0, 100, closed='right')

In [58]:
iv.overlaps(extended_iv)

True

In [59]:
time_iv = pd.Interval(pd.Timestamp("2024-01-01"), pd.Timestamp("2024-01-03"))

time_iv

Interval(2024-01-01 00:00:00, 2024-01-03 00:00:00, closed='right')

In [60]:
pd.Timestamp("2024-01-02") in time_iv

True

# Manipulating data

## Categorical data

In [61]:
mySerie = pd.Series([1, 2, 3, 1, 2, 3])

mySerie

0    1
1    2
2    3
3    1
4    2
5    3
dtype: int64

In [63]:
myCat = pd.Categorical(mySerie)

print(type(myCat))

myCat

<class 'pandas.core.arrays.categorical.Categorical'>

[1, 2, 3, 1, 2, 3]
Categories (3, int64): [1, 2, 3]

In [64]:
myList = ["male", "female", "male", "female", "male", "female", "male", "female", "male", "female"]

genderCat = pd.Categorical(myList)

genderCat

['male', 'female', 'male', 'female', 'male', 'female', 'male', 'female', 'male', 'female']
Categories (2, object): ['female', 'male']

In [66]:
import numpy as np

In [67]:
# categorical ignore missing values
pd.Categorical([1, 2, 3, 1, 2, 3, np.nan])

[1, 2, 3, 1, 2, 3, NaN]
Categories (3, int64): [1, 2, 3]

In [70]:
# categories can be defined manually
pd.Categorical([1, 2, 3, 1, 2, 3], categories=[1, 2])

[1, 2, NaN, 1, 2, NaN]
Categories (2, int64): [1, 2]

In [74]:
# we can change a type of serie to categorical
mySerie = pd.Series([1, 2, 3, 1, 2, 3])

mySerie = mySerie.astype("category")

mySerie

0    1
1    2
2    3
3    1
4    2
5    3
dtype: category
Categories (3, int64): [1, 2, 3]

In [75]:
# why to use categories in pandas

data = {
    "Name": ["Alice", "Bob", "Charlie", "David"],
    "Education": ["Bachelors", "Masters", "High School", "Bachelors"],
}

df = pd.DataFrame(data)

df

      Name    Education
0    Alice    Bachelors
1      Bob      Masters
2  Charlie  High School
3    David    Bachelors

In [76]:
df.sort_values(["Education"])

      Name    Education
0    Alice    Bachelors
3    David    Bachelors
2  Charlie  High School
1      Bob      Masters

In [85]:
# how to sort by education level

print(type(df["Education"]))
print("-------------")
df["Education"] = pd.Categorical(df["Education"], categories=["High School", "Bachelors", "Masters"], ordered=True)

print(df.info())
print("-------------")

print(df["Education"])
print("-------------")

df.sort_values(["Education"])

<class 'pandas.core.series.Series'>
-------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       4 non-null      object
 1   Education  4 non-null      category
dtypes: category(1), object(1)
memory usage: 300.0+ bytes
None
-------------
0      Bachelors
1        Masters
2    High School
3      Bachelors
Name: Education, dtype: category
Categories (3, object): ['High School' < 'Bachelors' < 'Masters']
-------------

      Name    Education
2  Charlie  High School
0    Alice    Bachelors
3    David    Bachelors
1      Bob      Masters

In [88]:
# filter
# df.loc[[True, False, False, True]]
# df["Education"] > "Bachelors"

df.loc[df["Education"] > "Bachelors"]

  Name Education
1  Bob   Masters

## Sparse data

In [91]:
# Sparse array - values mostly empty
# Dense array - values mostly filled

arr = np.random.rand(10)

arr

array([0.85428419, 0.70465232, 0.74987204, 0.89673131, 0.8781889 ,
       0.42318135, 0.63425036, 0.14120865, 0.18759476, 0.13660365])

In [93]:
arr[2:5] = np.nan

arr

array([0.85428419, 0.70465232,        nan,        nan,        nan,
       0.42318135, 0.63425036, 0.14120865, 0.18759476, 0.13660365])

In [94]:
sparse_arr = pd.arrays.SparseArray(arr)

sparse_arr

[0.854284193124841, 0.7046523158115638, nan, nan, nan, 0.4231813519216584, 0.6342503563122609, 0.14120864863608362, 0.18759476323611712, 0.13660365094420635]
Fill: nan
IntIndex
Indices: array([0, 1, 5, 6, 7, 8, 9])

In [95]:
from sys import getsizeof

print(getsizeof(arr))
print(getsizeof(sparse_arr))

192
56

In [96]:
# covert to array
np.asarray(sparse_arr)

array([0.85428419, 0.70465232,        nan,        nan,        nan,
       0.42318135, 0.63425036, 0.14120865, 0.18759476, 0.13660365])

In [97]:
# data type of sparse array
# first is for not empty vales, second for fill value
sparse_arr.dtype

Sparse[float64, nan]

In [102]:
# df to sparse df

df = pd.DataFrame(np.random.rand(10000, 4))

df

             0         1         2         3
0     0.256933  0.491738  0.150764  0.169405
1     0.132377  0.614920  0.987698  0.133915
2     0.487655  0.352711  0.112394  0.763591
3     0.912774  0.199900  0.246805  0.556790
4     0.446229  0.962405  0.332143  0.444687
...        ...       ...       ...       ...
9995  0.332388  0.558362  0.528962  0.527107
9996  0.052443  0.099375  0.032063  0.954690
9997  0.718908  0.475890  0.422462  0.219635
9998  0.632325  0.082363  0.157648  0.149413
9999  0.316173  0.473905  0.520136  0.054861

[10000 rows x 4 columns]

In [103]:
# set most values to nan

df.iloc[:9998] = np.nan

df

             0         1         2         3
0          NaN       NaN       NaN       NaN
1          NaN       NaN       NaN       NaN
2          NaN       NaN       NaN       NaN
3          NaN       NaN       NaN       NaN
4          NaN       NaN       NaN       NaN
...        ...       ...       ...       ...
9995       NaN       NaN       NaN       NaN
9996       NaN       NaN       NaN       NaN
9997       NaN       NaN       NaN       NaN
9998  0.632325  0.082363  0.157648  0.149413
9999  0.316173  0.473905  0.520136  0.054861

[10000 rows x 4 columns]

In [104]:
sdf = df.astype(pd.SparseDtype(dtype="float", fill_value=np.nan))

sdf

             0         1         2         3
0          NaN       NaN       NaN       NaN
1          NaN       NaN       NaN       NaN
2          NaN       NaN       NaN       NaN
3          NaN       NaN       NaN       NaN
4          NaN       NaN       NaN       NaN
...        ...       ...       ...       ...
9995       NaN       NaN       NaN       NaN
9996       NaN       NaN       NaN       NaN
9997       NaN       NaN       NaN       NaN
9998  0.632325  0.082363  0.157648  0.149413
9999  0.316173  0.473905  0.520136  0.054861

[10000 rows x 4 columns]

In [105]:
sdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       1 non-null      Sparse[float64, nan]
 1   1       1 non-null      Sparse[float64, nan]
 2   2       1 non-null      Sparse[float64, nan]
 3   3       1 non-null      Sparse[float64, nan]
dtypes: Sparse[float64, nan](4)
memory usage: 228.0 bytes

In [106]:
print(getsizeof(df))
print(getsizeof(sdf))

320164
260

In [108]:
df.memory_usage().sum()

320132

In [109]:
sdf.memory_usage().sum()

228

## String data

In [6]:
# default datatype is object

pd.Series(list("Hello"))

0    H
1    e
2    l
3    l
4    o
dtype: object

In [8]:
# recomended to use str as data type

pd.Series(list("Hello"), dtype="string")

0    H
1    e
2    l
3    l
4    o
dtype: string

In [10]:
# recomended to use str as data type

s = pd.Series(list("Hello"))

s = s.astype("string")

s

0    H
1    e
2    l
3    l
4    o
dtype: string

In [14]:
s = pd.Series([*list("Hello"),*[1, 2]], dtype="string")

s

0    H
1    e
2    l
3    l
4    o
5    1
6    2
dtype: string

In [15]:
# auto converted to specified data type
s[6]

'2'

In [34]:
import numpy as np

names = pd.Series(["  peTer  "," juLIA","Michael Jordan ","jake", np.nan])

names

0            peTer
1              juLIA
2    Michael Jordan
3               jake
4                NaN
dtype: object

In [35]:
# as we have string data type, we can now use str accessor to get access to lot of usefull methods
names.str.islower()

0    False
1    False
2    False
3     True
4      NaN
dtype: object

In [36]:
names.str.lower()

0            peter
1              julia
2    michael jordan
3               jake
4                NaN
dtype: object

In [37]:
names.str.capitalize()

0            peter
1              julia
2    Michael jordan
3               Jake
4                NaN
dtype: object

In [38]:
names.str.len()

0     9.0
1     6.0
2    15.0
3     4.0
4     NaN
dtype: float64

In [39]:
names.str.strip().str.capitalize()

0             Peter
1             Julia
2    Michael jordan
3              Jake
4               NaN
dtype: object

In [42]:
names.str.strip().str.split(" ")

0              [peTer]
1              [juLIA]
2    [Michael, Jordan]
3               [jake]
4                  NaN
dtype: object

In [43]:
names.str.strip().str.split(" ", expand=True)

         0       1
0    peTer    None
1    juLIA    None
2  Michael  Jordan
3     jake    None
4      NaN     NaN

In [44]:
names.str.cat()

'  peTer   juLIAMichael Jordan jake'

In [45]:
names.str.cat(sep="_")

'  peTer  _ juLIA_Michael Jordan _jake'

In [47]:
names.str.cat(["1", "2", "3", "4", "5"], sep="_")

0            peTer  _1
1              juLIA_2
2    Michael Jordan _3
3               jake_4
4                  NaN
dtype: object

## Small project demo

In [155]:
df_sales_data = pd.read_csv("sales_data.csv")

df_sales_data

                     date_time  customer_id product location       comments
0   2023-09-08 09:23:48.510176           22     Bag       FL  It is average
1   2023-06-10 08:23:48.510256           33   Socks       CA      I hate it
2   2023-12-08 05:23:48.510262           52    Shoe       CA  Too expensive
3   2023-08-31 19:23:48.510267           12    Shoe       NY        Too big
4   2023-06-15 09:23:48.510271           87   Pants       NY  Too expensive
..                         ...          ...     ...      ...            ...
95  2023-08-21 12:23:48.510663            1   Pants       CA   Good quality
96  2023-04-06 16:23:48.510666           24   Shirt       FL        Too big
97  2023-09-14 23:23:48.510670           37     Bag       FL  Too expensive
98  2023-06-02 01:23:48.510673           48   Socks       IL      I love it
99  2023-09-30 09:23:48.510677           18   Shirt       NY   Good quality

[100 rows x 5 columns]

### 1. create random delivery_date column and insert it into data frame

In [157]:
# My solution

# generate series of timedeltas
arr_delivery_days = pd.Series(pd.Timedelta(days=i) for i in np.random.randint(low=1, high= 7, size=len(df_sales_data)))
# print(arr_delivery_days)

# convert date_time to datetime data type
df_sales_data["date_time"] = pd.to_datetime(df_sales_data["date_time"])
# print(df_sales_data.info())

# create new column "delivery_date" by adding "date_time" and "arr_delivery_days"
df_sales_data["delivery_date"] = df_sales_data["date_time"] + arr_delivery_days
# print(df_sales_data)

df_sales_data

,date_time,customer_id,product,location,comments,delivery_date
0,2023-09-08 09:23:48.510176,22,Bag,FL,It is average,2023-09-11 09:23:48.510176
1,2023-06-10 08:23:48.510256,33,Socks,CA,I hate it,2023-06-11 08:23:48.510256
2,2023-12-08 05:23:48.510262,52,Shoe,CA,Too expensive,2023-12-10 05:23:48.510262
3,2023-08-31 19:23:48.510267,12,Shoe,NY,Too big,2023-09-02 19:23:48.510267
4,2023-06-15 09:23:48.510271,87,Pants,NY,Too expensive,2023-06-18 09:23:48.510271
...,...,...,...,...,...,...
95,2023-08-21 12:23:48.510663,1,Pants,CA,Good quality,2023-08-25 12:23:48.510663
96,2023-04-06 16:23:48.510666,24,Shirt,FL,Too big,2023-04-07 16:23:48.510666
97,2023-09-14 23:23:48.510670,37,Bag,FL,Too expensive,2023-09-20 23:23:48.510670
98,2023-06-02 01:23:48.510673,48,Socks,IL,I love it,2023-06-08 01:23:48.510673
99,2023-09-30 09:23:48.510677,18,Shirt,NY,Good quality,2023-10-03 09:23:48.510677

In [76]:
# Course solution

df_sales_data["date_time"] = pd.to_datetime(df_sales_data["date_time"])

import datetime
import random

delivery_dates = []

for dt in df_sales_data["date_time"]:
    delivery_dates.append(dt + datetime.timedelta(days=random.randint(1, 7)))

# print(delivery_dates)

df_sales_data["delivery_date"] = delivery_dates

df_sales_data

,date_time,customer_id,product,location,comments,delivery_date
0,2023-09-08 09:23:48.510176,22,Bag,FL,It is average,2023-09-12 09:23:48.510176
1,2023-06-10 08:23:48.510256,33,Socks,CA,I hate it,2023-06-17 08:23:48.510256
2,2023-12-08 05:23:48.510262,52,Shoe,CA,Too expensive,2023-12-15 05:23:48.510262
3,2023-08-31 19:23:48.510267,12,Shoe,NY,Too big,2023-09-06 19:23:48.510267
4,2023-06-15 09:23:48.510271,87,Pants,NY,Too expensive,2023-06-18 09:23:48.510271
...,...,...,...,...,...,...
95,2023-08-21 12:23:48.510663,1,Pants,CA,Good quality,2023-08-23 12:23:48.510663
96,2023-04-06 16:23:48.510666,24,Shirt,FL,Too big,2023-04-13 16:23:48.510666
97,2023-09-14 23:23:48.510670,37,Bag,FL,Too expensive,2023-09-21 23:23:48.510670
98,2023-06-02 01:23:48.510673,48,Socks,IL,I love it,2023-06-03 01:23:48.510673
99,2023-09-30 09:23:48.510677,18,Shirt,NY,Good quality,2023-10-06 09:23:48.510677

### 2. calculate how long it takes for order to arrive

In [158]:
# My solution, same as Course solution

df_sales_data["delivery_time"] = df_sales_data["delivery_date"] - df_sales_data["date_time"]

df_sales_data

,date_time,customer_id,product,location,comments,delivery_date,delivery_time
0,2023-09-08 09:23:48.510176,22,Bag,FL,It is average,2023-09-11 09:23:48.510176,3 days
1,2023-06-10 08:23:48.510256,33,Socks,CA,I hate it,2023-06-11 08:23:48.510256,1 days
2,2023-12-08 05:23:48.510262,52,Shoe,CA,Too expensive,2023-12-10 05:23:48.510262,2 days
3,2023-08-31 19:23:48.510267,12,Shoe,NY,Too big,2023-09-02 19:23:48.510267,2 days
4,2023-06-15 09:23:48.510271,87,Pants,NY,Too expensive,2023-06-18 09:23:48.510271,3 days
...,...,...,...,...,...,...,...
95,2023-08-21 12:23:48.510663,1,Pants,CA,Good quality,2023-08-25 12:23:48.510663,4 days
96,2023-04-06 16:23:48.510666,24,Shirt,FL,Too big,2023-04-07 16:23:48.510666,1 days
97,2023-09-14 23:23:48.510670,37,Bag,FL,Too expensive,2023-09-20 23:23:48.510670,6 days
98,2023-06-02 01:23:48.510673,48,Socks,IL,I love it,2023-06-08 01:23:48.510673,6 days
99,2023-09-30 09:23:48.510677,18,Shirt,NY,Good quality,2023-10-03 09:23:48.510677,3 days

### 3. Convert appropriate columns to categorical for memory efficiency

In [159]:
# My solution, same as Course solution
df_sales_data["product"] = pd.Categorical(df_sales_data["product"])

print(df_sales_data["product"])

df_sales_data["location"] = pd.Categorical(df_sales_data["location"])

df_sales_data["location"]

0       Bag
1     Socks
2      Shoe
3      Shoe
4     Pants
      ...
95    Pants
96    Shirt
97      Bag
98    Socks
99    Shirt
Name: product, Length: 100, dtype: category
Categories (5, object): ['Bag', 'Pants', 'Shirt', 'Shoe', 'Socks']

0     FL
1     CA
2     CA
3     NY
4     NY
      ..
95    CA
96    FL
97    FL
98    IL
99    NY
Name: location, Length: 100, dtype: category
Categories (5, object): ['CA', 'FL', 'IL', 'NY', 'TX']

### 4. remove bag products from dataframe

In [162]:
# My solution

# df_sales_data[~(df_sales_data["product"] == "Bag")]
df_sales_data = df_sales_data[df_sales_data["product"] != "Bag"]

df_sales_data

,date_time,customer_id,product,location,comments,delivery_date,delivery_time
1,2023-06-10 08:23:48.510256,33,Socks,CA,I hate it,2023-06-11 08:23:48.510256,1 days
2,2023-12-08 05:23:48.510262,52,Shoe,CA,Too expensive,2023-12-10 05:23:48.510262,2 days
3,2023-08-31 19:23:48.510267,12,Shoe,NY,Too big,2023-09-02 19:23:48.510267,2 days
4,2023-06-15 09:23:48.510271,87,Pants,NY,Too expensive,2023-06-18 09:23:48.510271,3 days
5,2023-03-26 17:23:48.510276,52,Shirt,CA,I hate it,2023-04-01 17:23:48.510276,6 days
...,...,...,...,...,...,...,...
94,2023-02-02 00:23:48.510659,97,Socks,NY,It is terrible,2023-02-07 00:23:48.510659,5 days
95,2023-08-21 12:23:48.510663,1,Pants,CA,Good quality,2023-08-25 12:23:48.510663,4 days
96,2023-04-06 16:23:48.510666,24,Shirt,FL,Too big,2023-04-07 16:23:48.510666,1 days
98,2023-06-02 01:23:48.510673,48,Socks,IL,I love it,2023-06-08 01:23:48.510673,6 days
99,2023-09-30 09:23:48.510677,18,Shirt,NY,Good quality,2023-10-03 09:23:48.510677,3 days

In [ ]:
# Course solution

# not rerunable
df_sales_data["product"] = df_sales_data["product"].cat.remove_categories("Bag")

df_sales_data.dropna()

df_sales_data

### 5. calculate, how many days it takes to deliver each product and each location

In [164]:
# My solution, same as Course solution

df_sales_data.groupby(["product", "location"], observed=True)["delivery_time"].sum()

product  location
Pants    CA         21 days
         FL         13 days
         IL         20 days
         NY         16 days
         TX          9 days
Shirt    CA         12 days
         FL         29 days
         IL          9 days
         NY         13 days
         TX         15 days
Shoe     CA         12 days
         FL         24 days
         IL         11 days
         NY         21 days
         TX         22 days
Socks    CA          3 days
         FL         14 days
         IL         12 days
         NY         19 days
         TX         13 days
Name: delivery_time, dtype: timedelta64[ns]

### 6. tokenize comments for later analysis into new dataframe

In [169]:
# My solution

df_sales_data["comments"] = df_sales_data["comments"].astype(dtype="string")

df_sales_data["comments"].str.split(" ", expand=True)

       0          1         2
1      I       hate        it
2    Too  expensive      <NA>
3    Too        big      <NA>
4    Too  expensive      <NA>
5      I       hate        it
..   ...        ...       ...
94    It         is  terrible
95  Good    quality      <NA>
96   Too        big      <NA>
98     I       love        it
99  Good    quality      <NA>

[83 rows x 3 columns]

In [171]:
# Course solution

comment_serie = df_sales_data["comments"]

comment_serie = comment_serie.astype(dtype="string")

comment_serie.str.strip().str.split(" ", expand=True)

       0          1         2
1      I       hate        it
2    Too  expensive      <NA>
3    Too        big      <NA>
4    Too  expensive      <NA>
5      I       hate        it
..   ...        ...       ...
94    It         is  terrible
95  Good    quality      <NA>
96   Too        big      <NA>
98     I       love        it
99  Good    quality      <NA>

[83 rows x 3 columns]